bekencorp/armino/middleware/soc/bk7236/soc/pwm_struct.h
    /* REG_0x12 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim1_rcr                       :32;  //0x12[31:0],TIM1的重复计数器设定值,在RCR+1次溢出后产生更新事件,0x0,R/W
        }; 
        uint32_t v; 
    }tim1_rcr; 

    /* REG_0x13 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim2_rcr                       :32;  //0x13[31:0],TIM2的重复计数器设定值,0x0,R/W
        }; 
        uint32_t v; 
    }tim2_rcr; 

    /* REG_0x14 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim3_rcr                       :32;  //0x14[31:0],TIM3的重复计数器设定值,0x0,R/W
        }; 
        uint32_t v; 
    }tim3_rcr; 

    /* REG_0x15 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr1                           :32;  //0x15[31:0],比较捕获寄存器CCR1的preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }ccr1; 

    /* REG_0x16 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr2                           :32;  //0x16[31:0],比较捕获寄存器CCR2的preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }ccr2; 

    /* REG_0x17 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr3                           :32;  //0x17[31:0],比较捕获寄存器CCR3的preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }ccr3; 

    /* REG_0x18 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr4                           :32;  //0x18[31:0],比较捕获寄存器CCR4的preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }ccr4; 

    /* REG_0x19 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr5                           :32;  //0x19[31:0],比较捕获寄存器CCR5的preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }ccr5; 

    /* REG_0x1a */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr6                           :32;  //0x1a[31:0],比较捕获寄存器CCR6的preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }ccr6; 

    /* REG_0x1b */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr7                           :32;  //0x1b[31:0],比较捕获寄存器CCR7的preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }ccr7; 

    /* REG_0x1c */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr8                           :32;  //0x1c[31:0],比较捕获寄存器CCR8的preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }ccr8; 

    /* REG_0x1d */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr9                           :32;  //0x1d[31:0],比较捕获寄存器CCR9的preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }ccr9; 

    /* REG_0x1e */
    union 
    { 
        struct 
        { 
           volatile uint32_t  dt1                            :10;  //0x1e[9:0],out1与out0死区时间设置：0到0x400个周期,0x0,R/W
           volatile uint32_t  dt2                            :10;  //0x1e[19:10],out3与out2死区时间设置：0到0x400个周期,0x0,R/W
           volatile uint32_t  dt3                            :10;  //0x1e[29:20],out5与out4死区时间设置：0到0x400个周期,0x0,R/W
           volatile uint32_t  reserved                       : 2;  //0x1e[31:30], ,0x0,R/W
        }; 
        uint32_t v; 
    }dt; 

    /* REG_0x1f */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim1_arr_shad                  :32;  //0x1f[31:0],TIM1的定时器计数终点值shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }tim1_arr_shad; 

    /* REG_0x20 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim2_arr_shad                  :32;  //0x20[31:0],TIM2的定时器计数终点值shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }tim2_arr_shad; 

    /* REG_0x21 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim3_arr_shad                  :32;  //0x21[31:0],TIM3的定时器计数终点值shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }tim3_arr_shad; 

    /* REG_0x22 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim1_rcr_shad                  :32;  //0x22[31:0],TIM1的重复计数器设定值,在RCR+1次溢出后产生更新事件,0x0,RO
        }; 
        uint32_t v; 
    }tim1_rcr_shad; 

    /* REG_0x23 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim2_rcr_shad                  :32;  //0x23[31:0],TIM2的重复计数器设定值,0x0,RO
        }; 
        uint32_t v; 
    }tim2_rcr_shad; 

    /* REG_0x24 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim3_rcr_shad                  :32;  //0x24[31:0],TIM3的重复计数器设定值,0x0,RO
        }; 
        uint32_t v; 
    }tim3_rcr_shad; 

    /* REG_0x25 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr1_shad                      :32;  //0x25[31:0],比较捕获寄存器CCR1的shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }ccr1_shad; 

    /* REG_0x26 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr2_shad                      :32;  //0x26[31:0],比较捕获寄存器CCR2的shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }ccr2_shad; 

    /* REG_0x27 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr3_shad                      :32;  //0x27[31:0],比较捕获寄存器CCR3的shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }ccr3_shad; 

    /* REG_0x28 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr4_shad                      :32;  //0x28[31:0],比较捕获寄存器CCR4的shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }ccr4_shad; 

    /* REG_0x29 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr5_shad                      :32;  //0x29[31:0],比较捕获寄存器CCR5的shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }ccr5_shad; 

    /* REG_0x2a */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr6_shad                      :32;  //0x2a[31:0],比较捕获寄存器CCR6的shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }ccr6_shad; 

    /* REG_0x2b */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr7_shad                      :32;  //0x2b[31:0],比较捕获寄存器CCR7的shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }ccr7_shad; 

    /* REG_0x2c */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr8_shad                      :32;  //0x2c[31:0],比较捕获寄存器CCR8的shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }ccr8_shad; 

    /* REG_0x2d */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ccr9_shad                      :32;  //0x2d[31:0],比较捕获寄存器CCR9的shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }ccr9_shad; 

    /* REG_0x2e */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ch6e_shad                      : 1;  //0x2e[0],channel使能寄存器ch6e的shadow寄存器,0x0,RO
           volatile uint32_t  ch5e_shad                      : 1;  //0x2e[1],channel使能寄存器ch5e的shadow寄存器,0x0,RO
           volatile uint32_t  ch4e_shad                      : 1;  //0x2e[2],channel使能寄存器ch4e的shadow寄存器,0x0,RO
           volatile uint32_t  ch3e_shad                      : 1;  //0x2e[3],channel使能寄存器ch3e的shadow寄存器,0x0,RO
           volatile uint32_t  ch2e_shad                      : 1;  //0x2e[4],channel使能寄存器ch2e的shadow寄存器,0x0,RO
           volatile uint32_t  ch1e_shad                      : 1;  //0x2e[5],channel使能寄存器ch1e的shadow寄存器,0x0,RO
           volatile uint32_t  oc1m_shad                      : 3;  //0x2e[8:6],TIM1输出比较模式寄存器oc1m的shadow寄存器,0x0,RO
           volatile uint32_t  oc2m_shad                      : 3;  //0x2e[11:9],TIM2输出比较模式寄存器oc2m的shadow寄存器,0x0,RO
           volatile uint32_t  oc3m_shad                      : 3;  //0x2e[14:12],TIM3输出比较模式寄存器oc3m的shadow寄存器,0x0,RO
           volatile uint32_t  reserved                       :17;  //0x2e[31:15],比较捕获寄存器CCR9的shadow寄存器,0x0,RO
        }; 
        uint32_t v; 
    }chxe_shad; 

} pwm_hw_t;

#ifdef __cplusplus 
}                  
#endif             
